var ramisoft = ramisoft || {};
ramisoft.learn = ramisoft.learn || {};
ramisoft.learn.g  = ramisoft.learn.g || {};
var g = ramisoft.learn.g;
var u = ramisoft.util;
var shuffleIndex = g.shuffleIndex;
g.seek = 0;

g.gunintalu = [
    ['కా', 'కి', 'కీ', 'కు', 'కూ', 'కృ', 'కౄ', 'కె', 'కే', 'కై', 'కొ', 'కో', 'కౌ', 'కం', 'కః'],
    ['ఖా', 'ఖి', 'ఖీ', 'ఖు', 'ఖూ', 'ఖృ', 'ఖౄ', 'ఖె', 'ఖే', 'ఖై', 'ఖొ', 'ఖో', 'ఖౌ', 'ఖం', 'ఖః'],
    ['గా', 'గి', 'గీ', 'గు', 'గూ', 'గృ', 'గౄ','గె', 'గే', 'గై', 'గొ', 'గో', 'గౌ', 'గం', 'గః'],
    ['ఘా', 'ఘి', 'ఘీ', 'ఘు', 'ఘూ', 'ఘృ', 'ఘౄ','ఘె', 'ఘే', 'ఘై', 'ఘొ', 'ఘో', 'ఘౌ', 'ఘం', 'ఘః'],
    ['ఙా', 'ఙి', 'ఙీ', 'ఙు', 'ఙూ', 'ఙృ', 'ఙౄ','ఙె', 'ఙే', 'ఙై', 'ఙొ', 'ఙో', 'ఙౌ', 'ఙం', 'ఙః'],
    ['చా', 'చి', 'చీ', 'చు', 'చూ', 'చృ', 'చౄ','చె', 'చే', 'చై', 'చొ', 'చో', 'చౌ', 'చం', 'చః'],
    ['ఛా', 'ఛి', 'ఛీ', 'ఛు', 'ఛూ', 'ఛృ', 'ఛౄ','ఛె', 'ఛే', 'ఛై', 'ఛొ', 'ఛో', 'ఛౌ', 'ఛం', 'ఛః'],
    ['జా', 'జి', 'జీ', 'జు', 'జూ', 'జృ', 'జౄ','జె', 'జే', 'జై', 'జొ', 'జో', 'జౌ', 'జం', 'జః'],
    ['ఝా', 'ఝి', 'ఝీ', 'ఝు', 'ఝూ', 'ఝృ', 'ఝౄ', 'ఝె', 'ఝే', 'ఝై', 'ఝొ', 'ఝో', 'ఝౌ',  'ఝం', 'ఝః'],
    ['ఞా', 'ఞి', 'ఞీ', 'ఞు', 'ఞూ', 'ఞృ', 'ఞౄ','ఞె', 'ఞే', 'ఞై', 'ఞొ', 'ఞో', 'ఞౌ',  'ఞం', 'ఞః'],
    ['టా', 'టి', 'టీ', 'టు', 'టూ', 'టృ', 'టౄ', 'టె', 'టే', 'టై', 'టొ', 'టో', 'టౌ', 'టం', 'టః'],
    ['ఠా', 'ఠి', 'ఠీ', 'ఠు', 'ఠూ', 'ఠృ', 'ఠౄ', 'ఠె', 'ఠే', 'ఠై', 'ఠొ', 'ఠో', 'ఠౌ', 'ఠం', 'ఠః'],
    ['డా', 'డి', 'డీ', 'డు', 'డూ', 'డృ', 'డౄ','డె', 'డే', 'డై', 'డొ', 'డో', 'డౌ', 'డం', 'డః'],
    ['ఢా', 'ఢి', 'ఢీ', 'ఢు', 'ఢూ', 'ఢృ', 'ఢౄ','ఢె', 'ఢే', 'ఢై', 'ఢొ', 'ఢో', 'ఢౌ', 'ఢం', 'ఢః'],
    ['ణా', 'ణి', 'ణీ', 'ణు', 'ణూ', 'ణృ', 'ణౄ', 'ణె', 'ణే', 'ణై', 'ణొ', 'ణో', 'ణౌ',  'ణం', 'ణః'],
    ['తా', 'తి', 'తీ', 'తు', 'తూ', 'తృ', 'తౄ', 'తె', 'తే', 'తై', 'తొ', 'తో', 'తౌ', 'తం', 'తః'],
    ['థా', 'థి', 'థీ', 'థు', 'థూ', 'థృ', 'థౄ', 'థె', 'థే', 'థై', 'థొ', 'థో', 'థౌ', 'థం', 'థః'],
    ['దా', 'ది', 'దీ', 'దు', 'దూ', 'దృ', 'దౄ', 'దె', 'దే', 'దై', 'దొ', 'దో', 'దౌ', 'దం', 'దః'],
    ['ధా', 'ధి', 'ధీ', 'ధు', 'ధూ', 'ధృ', 'ధౄ', 'ధె', 'ధే', 'ధై', 'ధొ', 'ధో', 'ధౌ', 'ధం', 'ధః'],
    ['నా', 'ని', 'నీ', 'ను', 'నూ', 'నృ', 'నౄ', 'నె', 'నే', 'నై', 'నొ', 'నో', 'నౌ', 'నం', 'నః'],
    ['పా', 'పి', 'పీ', 'పు', 'పూ', 'పృ', 'పౄ','పె', 'పే', 'పై', 'పొ', 'పో', 'పౌ',  'పం', 'పః'],
    ['ఫా', 'ఫి', 'ఫీ', 'ఫు', 'ఫూ', 'ఫృ', 'ఫౄ','ఫె', 'ఫే', 'ఫై', 'ఫొ', 'ఫో', 'ఫౌ',  'ఫం', 'ఫః'],
    ['బా', 'బి', 'బీ', 'బు', 'బూ', 'బృ', 'బౄ', 'బె', 'బే', 'బై', 'బొ', 'బో', 'బౌ', 'బం', 'బః'],
    ['భా', 'భి', 'భీ', 'భు', 'భూ', 'భృ', 'భౄ', 'భె', 'భే', 'భై', 'భొ', 'భో', 'భౌ', 'భం', 'భః'],
    ['మా', 'మి', 'మీ', 'ము', 'మూ', 'మృ', 'మౄ','మె', 'మే', 'మై', 'మొ', 'మో', 'మౌ', 'మం', 'మః'],
    ['యా', 'యి', 'యీ', 'యు', 'యూ', 'యృ', 'యౄ', 'యె', 'యే', 'యై', 'యొ', 'యో', 'యౌ', 'యం', 'యః'],
    ['రా', 'రి', 'రీ', 'రు', 'రూ', 'రృ', 'రౄ', 'రె', 'రే', 'రై', 'రొ', 'రో', 'రౌ', 'రం', 'రః'],
    ['లా', 'లి', 'లీ', 'లు', 'లూ', 'లృ', 'లౄ','లె', 'లే', 'లై', 'లొ', 'లో', 'లౌ', 'లం', 'లః'],
    ['వా', 'వి', 'వీ', 'వు', 'వూ', 'వృ', 'వౄ','వె', 'వే', 'వై', 'వొ', 'వో', 'వౌ', 'వం', 'వః'],
    ['శా', 'శి', 'శీ', 'శు', 'శూ', 'శృ', 'శౄ','శె', 'శే', 'శై', 'శొ', 'శో', 'శౌ', 'శం', 'శః'],
    ['షా', 'షి', 'షీ', 'షు', 'షూ', 'షృ', 'షౄ', 'షె', 'షే', 'షై', 'షొ', 'షో', 'షౌ', 'షం', 'షః'],
    ['సా', 'సి', 'సీ', 'సు', 'సూ', 'సృ', 'సౄ', 'సె', 'సే', 'సై', 'సొ', 'సో', 'సౌ', 'సం', 'సః'],
    ['హా', 'హి', 'హీ', 'హు', 'హూ', 'హృ', 'హౄ', 'హె', 'హే', 'హై', 'హొ', 'హో', 'హౌ', 'హం', 'హః'],
    ['ళా', 'ళి', 'ళీ', 'ళు', 'ళూ', 'ళృ', 'ళౄ','ళె', 'ళే', 'ళై', 'ళొ', 'ళో', 'ళౌ', 'ళం', 'ళః'],
    ['క్షా', 'క్షి', 'క్షీ', 'క్షు', 'క్షూ', 'క్షృ', 'క్షౄ','క్షె', 'క్షే', 'క్షై', 'క్షొ', 'క్షో', 'క్షౌ', 'క్షం', 'క్షః'],
    ['ఱా', 'ఱి', 'ఱీ', 'ఱు', 'ఱూ', 'ఱృ', 'ఱౄ', 'ఱె', 'ఱే', 'ఱై', 'ఱొ', 'ఱో', 'ఱౌ', 'ఱం', 'ఱః']    
];
g.gLetters = ['క', 'ఖ', 'గ', 'ఘ', 'ఙ', 'చ', 'ఛ', 'జ', 'ఝ', 'ఞ', 'ట', 'ఠ', 'డ', 'ఢ', 'ణ', 'త', 'థ', 'ద', 'ధ', 'న', 'ప', 'ఫ', 'బ', 'భ', 'మ', 'య', 'ర', 'ల', 'వ', 'శ', 'ష', 'స', 'హ', 'ళ', 'క్ష', 'ఱ'];
g.selectedGLabel=g.gLetters[0];
g.selectedGValue=g.gunintalu[0];

g.setHeading = function(letter){
    $('#selectedLetter').text(letter);
}
g.shuffle = function(collection){
    g.shuffleIndex = u.shuffle(collection);
    g.seek = 0;
    g.maxLetters = collection.length - 1;
    g.showLetter();
    g.checkPreNext();
}
g.showLetter = function(){
    $('#gLetter').text(g.selectedGValue[g.shuffleIndex[g.seek]]);
}

g.checkPreNext = function(){
    (g.seek != 0 ) ? u.buttionEnableDisable('gPre', 'enable') : 
        u.buttionEnableDisable('gPre', 'disable');
    (g.seek < g.maxLetters) ? u.buttionEnableDisable('gNext', 'enable') : 
    u.buttionEnableDisable('gNext', 'disable');  
}

g.moveNext = function(sc){
    sc.seek = sc.seek + 1;
    sc.showLetter()
    sc.checkPreNext();
}

g.movePre = function(sc) {
    sc.seek = sc.seek - 1;
    sc.showLetter()
    sc.checkPreNext();
}

g.viewInit= function(){
    $('.button').button();
    //$( ".selectmenu" ).selectmenu(); FIX IT
    
    g.seleGunintam = g.gunintalu[0];
    g.setHeading(g.selectedGLabel);
    g.shuffle(g.gunintalu[0]);

    //populate dropdown and set initial selected option
    $.each(g.gLetters, function(i, v){
        var opt = '<option value="'+ i +'">'+v+'</option>';
        $('#gSelect').append(opt);
    });
    $('#gShuffle').on('click', function(){
        g.shuffle(g.selectedGValue);
    });

    //FIXIT
    /* $('#gSelect').selectmenu({
        select: function( event, ui ) {
            g.selectedGValue=g.gunintalu[ui.item.value];
            g.selectedGLabel=ui.item.label;
            g.setHeading(g.selectedGLabel);
            g.shuffle(g.selectedGValue);
            g.maxLetters = g.selectedGValue.length- 1;
        }
    }); */
    //FIXIT
    /* $('#gSelect').selectmenu({
        width: 80
      }).prop("selectedIndex",0).selectmenu('refresh'); */
    
    $('#gPre').on('click', function(){
        g.movePre(g);
    });
    $('#gNext').on('click', function(){
        g.moveNext(g);
    });
}
